{
    "events": [
      {
        "eventName": "ISA Diwali Celebration",
        "description": "Join the India Students Association in a luminous celebration of Diwali, the Festival of Lights! This vibrant event promises an evening filled with cultural splendor, traditional dances, and an array of delectable dishes that capture the essence of this auspicious occasion. ISA invites you to immerse yourself in the heartwarming glow of community and tradition. Let’s light up the skies with joy, laughter, and the spirit of togetherness. Mark your calendars and bring your friends and family to share in an experience that will dazzle the senses and kindle the light within. See you there for a night to remember!",
        "src": "./images/diwali.jpeg"
      },
      {
        "eventName": "Hack ISU",
        "description": "Join us at Hack ISU, an exciting hackathon designed to ignite your passion for computer science! This event is the perfect opportunity for students to dive into the world of coding, explore new technologies, and experiment with innovative ideas. Whether you're a seasoned programmer or just starting, Hack ISU offers a supportive environment to learn, grow, and collaborate with fellow enthusiasts. So gather your team, bring your creativity, and get ready to hack your way to success. Don't miss this chance to challenge yourself and discover what you can achieve in the world of computer science!",
        "src": "./images/hackathon.png"
      },
      {
        "eventName": "Super Smash Bros Tournament",
        "description": "Get ready to battle it out at the Super Smash Bros Tournament! This is your chance to showcase your skills and compete against other players in a thrilling showdown. Whether you're a seasoned fighter or new to the game, this tournament offers an exciting platform to test your abilities and strategize your way to victory. Sign up now, bring your A-game, and see if you have what it takes to claim the title and win it all. Don't miss this opportunity to prove yourself in the arena and be a part of the ultimate Super Smash Bros experience!",
        "src": "./images/superSmash.png"
      },
        {
        "eventName": "Fortnite Tournament",
        "description": "Get ready to battle it out at the Super Smash Bros Tournament! This is your chance to showcase your skills and compete against other players in a thrilling showdown. Whether you're a seasoned fighter or new to the game, this tournament offers an exciting platform to test your abilities and strategize your way to victory. Sign up now, bring your A-game, and see if you have what it takes to claim the title and win it all. Don't miss this opportunity to prove yourself in the arena and be a part of the ultimate Super Smash Bros experience!",
        "src": "./images/fortnite.jpeg"
      },
        {
        "eventName": "Cleanup Day",
        "description": "The green club is hosting a community cleanup day that's fun for all ages! Gather your neighbors and friends for a day dedicated to making your local area cleaner and greener. Enjoy outdoor activities, recycling games, and a picnic to celebrate your hard work. It's a great way to connect with your community and make a positive impact on the environment.",
        "src": "./images/cleanup.png"
      },
        {
        "eventName": "Culture Appreciation Night",
        "description": "We are organizing a local food festival to celebrate the diverse flavors of your community. We have invited food vendors, chefs, and local restaurants to share their best dishes, from traditional recipes to modern twists. Add live music, cooking demonstrations, and tasting contests for a full day of fun and delicious eats. It's a perfect event for foodies and families alike to explore new tastes and enjoy the community vibe.",
        "src": "./images/Culture.png"
      }
    ]
  }